Repository: MasterYodaOfficial/VPN_3
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# about_message
source: <b>🌐 ABOUT QuickVPN SERVICE</b> 🔐 <b>Security</b> We use only modern protocols and end-to-end encryption (AES-256, ChaCha20). <b>No logs, no tracking</b>. Just pure internet. 🚀 <b>Speed</b> No compromises — our servers deliver up to <code>10 Gbps</code>. Streams, Shorts, Reels — lag-free, even during peak hours. 📶 <b>Stability</b> Each user gets a <b>personal IP address</b>. ✅ This means fewer bans and restrictions from services and social networks. 🧠 <b>Simplicity</b> Only the necessary buttons. The entire connection process takes <b>less than 2 minutes</b>. 🛡️ <b>Trust</b> Users choose us because we are: • <b>Secure</b> (No-logs policy) • <b>Simple</b> (even for beginners) • <b>Works everywhere</b> (including Turkey, UAE, China, RF) • <b>Real 24/7 support</b> 📞 <b>Need help? For questions and suggestions:</b> Contact support directly: <a href="{support}">here</a> <a href="{owner}">questions, advertising, proposals</a> — we are online.
ru: <b>🌐 О СЕРВИСЕ QuickVPN</b> 🔐 <b>Безопасность</b> Мы используем только современные протоколы и end-to-end шифрование (AES-256, ChaCha20). <b>Нет логов, нет отслеживания</b>. Только чистый интернет. 🚀 <b>Скорость</b> Никаких компромиссов — наши сервера выдают до <code>10 Гбит/с</code>. Стримы, Shorts, Reals — без лагов, даже в час пик. 📶 <b>Стабильность</b> Каждому пользователю выдаются <b>персональные IP</b>. ✅ Это значит — меньше банов и ограничений от сервисов и соцсетей. 🧠 <b>Простота</b> Только нужные кнопки. Весь процесс подключения занимает <b>меньше 2 минут</b>. 🛡️ <b>Доверие</b> Нас выбирают, потому что: • <b>Безопасно</b> (No-logs политика) • <b>Просто</b> (даже для новичков) • <b>Работает везде</b> (включая Турцию, ОАЭ, Китай, РФ) • <b>Реальная поддержка 24/7</b> 📞 <b>Нужна помощь? По вопросам и предложениям:</b> Пиши прямо в поддержку: <a href="{support}">сюда</a> <a href="{owner}">вопросы, реклама, предложения</a> — мы на связи.

# help_main_message
source: <b>🛟 QuickVPN Help Section</b> Here you will find answers to most questions. Please select a section you are interested in:
ru: <b>🛟 Раздел помощи QuickVPN</b> Здесь вы найдете ответы на большинство вопросов. Выберите интересующий вас раздел:

# choose_sys
source: Choose your operating system:
ru: Выберите вашу операционную систему:

# help_faq_message
source: <b>❓ Frequently Asked Questions (FAQ)</b> <b>Q: How many devices can I use with one subscription?</b> A: One subscription is for one device only. This keeps your IP stable and the speed high. For more devices, you can get additional subscriptions. <b>Q: Do you keep logs of my activity?</b> A: No. We strictly follow a No-Logs policy. Your activity is completely anonymous. <b>Q: What if my connection is slow?</b> A: Try reconnecting. In Happ or Hiddify apps, enable the "Auto ⚡️" mode — it will connect you to the fastest server automatically. <b>Q: VPN won’t connect, what should I do?</b> A: 1. Check your internet connection. 2. Restart your device. 3. Remove the subscription from the app and add it again via the bot. 4. If nothing helps — contact support. <a href="{owner}">questions, advertising, proposals</a> — we are online.
ru: <b>❓ Частые вопросы (FAQ)</b> <b>В: На скольких устройствах я могу использовать одну подписку?</b> О: Одна подписка рассчитана на одно устройство — так сохраняется стабильный IP и высокая скорость. Для других устройств можно оформить отдельные подписки. <b>В: Вы храните логи моей активности?</b> О: Нет. Мы строго придерживаемся политики No-Logs. Ваша активность полностью анонимна. <b>В: Что делать, если скорость низкая?</b> О: Попробуйте переподключиться. В приложениях Happ или Hiddify включите режим «Auto ⚡️» — он автоматически выберет самый быстрый сервер. <b>В: VPN не подключается, что делать?</b> О: 1. Проверьте интернет-соединение. 2. Перезагрузите устройство. 3. Удалите подписку из приложения и добавьте её заново через кнопку в боте. 4. Если ничего не помогает — напишите в поддержку. <a href="{owner}">вопросы, реклама, предложения</a> — мы на связи.

# help_android_vless
source: 📌 <b>Setup Guide for Android</b> 📱 1️⃣ In the bot, press «Get Configs». This will open your subscription page. 2️⃣ On the page you can: • Install the <b>Happ</b> app (recommended) or another client like Hiddify or v2RayTun. • Tap «Open in App» — the subscription will be added automatically. • Or download the subscription link and paste it into any client manually. ✅ Done! The subscription will appear in the app — just press «Connect». <a href="{video}">Video guide</a> — we’re here to help.
ru: 📌 <b>Инструкция для Android</b> 📱 1️⃣ В боте нажмите кнопку «Получить конфиги». Откроется страница подписки. 2️⃣ На странице вы сможете: • Установить приложение <b>Happ</b> (рекомендуем) или другое, например Hiddify или v2RayTun. • Нажать «Открыть в приложении» — подписка добавится автоматически. • Или скачать ссылку и вставить её в любое приложение вручную. ✅ Всё! После этого подписка появится в приложении — нажмите «Подключиться». <a href="{video}">Видеоинструкция</a> — мы на связи.

# help_ios_vless
source: 📌 <b>Setup Guide for iOS</b> 📱 1️⃣ In the bot, press «Get Configs». This will open your subscription page. 2️⃣ On the page you can: • Install the <b>Happ</b> app (recommended) or another client like Hiddify or v2RayTun. • Tap «Open in App» — the subscription will be added instantly. • Or download the subscription link and add it manually into any app. ✅ Done! The subscription will appear in the app — press «Connect». <a href="{video}">Video guide</a> — we’re here to help.
ru: 📌 <b>Инструкция для iOS</b> 📱 1️⃣ В боте нажмите кнопку «Получить конфиги». Откроется страница подписки. 2️⃣ На странице вы сможете: • Установить приложение <b>Happ</b> (рекомендуем) или другое, например Hiddify или v2RayTun. • Нажать «Открыть в приложении» — подписка сразу добавится. • Или скачать ссылку и вставить её вручную в любое приложение. ✅ Всё! Подписка появится в списке клиента — просто нажмите «Подключиться». <a href="{video}">Видеоинструкция</a> — мы на связи.

# help_desktop_vless
source: 📌 <b>Setup Guide for Windows / macOS</b> 💻 1️⃣ In the bot, press «Get Configs». This will open your subscription page. 2️⃣ On the page you can: • Download and install <b>Hiddify Next</b> or another client. • Add the subscription in one click by pressing «Open in App» (if your client supports it). • Or download the subscription link and paste it manually into the program. ✅ Done! The subscription will appear in the client — just press «Connect». <a href="{video}">Video guide</a> — we’re here to help.
ru: 📌 <b>Инструкция для Windows / macOS</b> 💻 1️⃣ В боте нажмите кнопку «Получить конфиги». Откроется страница подписки. 2️⃣ На странице вы сможете: • Скачать и установить <b>Hiddify Next</b> или другой удобный клиент. • Добавить подписку одним кликом («Открыть в приложении»), если клиент это поддерживает. • Или скачать ссылку и вставить её вручную в программу. ✅ Всё! Подписка появится в клиенте — нажмите «Подключиться». <a href="{video}">Видеоинструкция</a> — мы на связи.

# profile_message
source: <b>👤 Your Profile</b> 🔐 <b>Active subscriptions:</b> <code>{active_subscriptions_count}</code> ━━━━━━━━━━━━━━━━━━━ 📦 <b>Subscription Management:</b> — <b>Each subscription</b> is a multi-server key compiled from several of the least loaded servers — Multiple subscriptions can be purchased ━━━━━━━━━━━━━━━━━━━ 🔧 <b>What you can do:</b> 🔹 <b>Renew subscription</b> — if it's expiring 🔹 <b>Buy a new one</b> — for a new device <i>Choose an action using the buttons below ⬇️</i>
ru: <b>👤 Ваш профиль</b> 🔐 <b>Активных подписок:</b> <code>{active_subscriptions_count}</code> ━━━━━━━━━━━━━━━━━━━ 📦 <b>Управление подписками:</b> — <b>Каждая подписка</b> — это мультисерверный ключ, собранный из нескольких наименее загруженных серверов — Возможна покупка нескольких подписок ━━━━━━━━━━━━━━━━━━━ 🔧 <b>Что вы можете сделать:</b> 🔹 <b>Продлить подписку</b> — если истекает срок 🔹 <b>Купить новую</b> — для нового устройства <i>Выберите действие с помощью кнопок ниже ⬇️</i>

# generating_subs
source: ⏳ Generating trial subscription...
ru: ⏳ Генерируем пробную подписку...

# error_subs_create
source: ❌ Failed to create subscription. Please try again later...
ru: ❌ Не удалось создать подписку. Попробуйте позже...

# trial_message
source: 🎉 <b>Your TRIAL ACCESS is now active!</b> Now you can try <b>🚀 {logo_name}</b> with no limits. 👇 Tap the button below to get your config and connect. 🔥 <i>Hurry up, trial access is available for a limited time!</i>
ru: 🎉 <b>Твой ПРОМО-ДОСТУП активирован!</b> Теперь ты можешь протестировать <b>🚀 {logo_name}</b> без ограничений. 👇 Нажми кнопку ниже, чтобы получить конфиг и подключиться. 🔥 <i>Поторопись, промо-доступ действует ограниченное время!</i>

# choose_tariff_message
source: 💼 <b>Choose a plan that suits you</b> 📅 Options from 1 month to 1 year are available 💰 The longer the term, the lower the price per month! ━━━━━━━━━━━━━━━━━━━ 📦 <b>What's included in the subscription:</b> • One plan — one subscription • Each subscription is a multi-key from several of the freest servers • The subscription works on one device • You can buy several subscriptions at once (e.g., for the family) ━━━━━━━━━━━━━━━━━━━ 👇 Choose a plan to proceed to payment:
ru: 💼 <b>Выберите тариф, который вам подходит</b> 📅 Доступны варианты от 1 месяца до 1 года 💰 Чем дольше срок — тем ниже цена за месяц! ━━━━━━━━━━━━━━━━━━━ 📦 <b>Что входит в подписку:</b> • Один тариф — одна подписка • Каждая подписка — это мультиключ из нескольких самых свободных серверов • Подписка работает на одном устройстве • Можно купить несколько подписок сразу (например, для семьи) ━━━━━━━━━━━━━━━━━━━ 👇 Выберите тариф, чтобы перейти к оплате:

# not_subs
source: You have no active subscriptions
ru: У вас нет активных подписок

# choose_subscription_text_extend
source: <b>🔁 Renew subscription</b> Please choose which one you want to renew:
ru: <b>🔁 Продление подписки</b> Пожалуйста, выберите, какую вы хотите продлить:

# active_configs_list_message
source: <b>🔑 Your active VPN accesses</b> Below are all your subscriptions. Just click on the button for the one you need — and a WebApp with the setup will open. <i>💡 All currently available VPN applications (Happ, Hiddify, v2RayTun, and others) are supported.</i>
ru: <b>🔑 Твои активные VPN-доступы</b> Ниже собраны все твои подписки. Просто нажми на кнопку с нужной — и откроется WebApp с настройкой. <i>💡 Поддерживаются все доступные на текущий момент VPN приложения (Happ, Hiddify, v2RayTun и другие).</i>

# choose_payment_message
source: <b>💳 Available payment options:</b>
ru: <b>💳 Доступные варианты оплаты:</b>

# error_payment
source: 🧐 Something went wrong, please try again later.
ru: 🧐 Что то пошло не так, поробуйте позже.

# payment_message
source: ✅ Payment has been created! 📝 Plan: <b>{tariff_name}</b> 💰 Amount to pay: <b>{amount}₽</b> As soon as you complete the payment, I will send you a notification and connection details. 👇 Click the button below to proceed to payment:
ru: ✅ Платёж сформирован! 📝 Тариф: <b>{tariff_name}</b> 💰 Сумма к оплате: <b>{amount}₽</b> Как только вы завершите оплату, я пришлю вам уведомление и данные для подключения. 👇 Нажми на кнопку ниже, чтобы перейти к оплате:

# referral_message
source: <b>🎉 QuickVPN Referral Program</b> 👤 <b>Your account:</b> — 👥 Friends invited: <code>{referrals_count}</code> — 💸 Earned: <code>{earned}₽</code> 🔗 <b>Your personal link:</b> <code>https://t.me/{bot_name}?start={referral_code}</code> ━━━━━━━━━━━━━━━━━━━ <b>💼 How it works:</b> 1. Share your link with friends, subscribers, on social media, and in chats 2. When someone registers using your link and makes a purchase — you instantly receive <b>{commission_precent}%</b> to your balance! 3. The money can be used to pay for VPN or withdrawn upon reaching 1000₽ <b>🧠 Tip:</b> try placing the link in: • A Telegram channel / group • Instagram / TikTok bio • A forum or a thematic chat • Under a video or post with a review 🎯 <u>Your goal is to bring at least 3 friends</u> and start using VPN for free! 🚀 <b>Start earning right now:</b> — Click "Share" and send the link to a friend — Or tell how QuickVPN helps you to be in another country digitally, speed up the internet, and save battery 🛟 <i>Need help? Contact support or check /help</i>
ru: <b>🎉 Реферальная программа QuickVPN</b> 👤 <b>Ваш аккаунт:</b> — 👥 Приглашено друзей: <code>{referrals_count}</code> — 💸 Заработано: <code>{earned}₽</code> 🔗 <b>Ваша персональная ссылка:</b> <code>https://t.me/{bot_name}?start={referral_code}</code> ━━━━━━━━━━━━━━━━━━━ <b>💼 Как это работает:</b> 1. Делитесь своей ссылкой с друзьями, подписчиками, в соцсетях и чатах 2. Когда кто-то регистрируется по вашей ссылке и делает покупку — вы мгновенно получаете <b>{commission_precent}%</b> на свой баланс! 3. Деньги можно использовать для оплаты VPN или вывода при достижении 1000₽ <b>🧠 Подсказка:</b> попробуйте разместить ссылку в: • Telegram-канале / группе • Bio Instagram / TikTok • Форуме или тематическом чате • Под видео или постом с отзывом 🎯 <u>Ваша цель — привести хотя бы 3 друга</u> и начать пользоваться VPN бесплатно! 🚀 <b>Начните зарабатывать прямо сейчас:</b> — Нажмите «Поделиться» и отправьте ссылку другу — Или расскажите, как QuickVPN помогает вам в цифровой среде находиться в другой стране, ускорять интернет и экономить заряд 🛟 <i>Нужна помощь? Напишите в поддержку или изучите /help</i>

# payment_not_found
source: Payment not found in the system. Please create a new one.
ru: Платеж не найден в системе. Пожалуйста, создайте его заново.

# payment_done
source: This payment has already been processed. Please create a new one.
ru: Этот платеж уже был обработан. Пожалуйста, создайте новый.

# subscription_purchased_with_config_message
source: ✅ <b>Payment successful!</b> Plan: <b>{tariff_name}</b> Your subscription <code>{sub_name}</code> is now active. 👇 Tap the button below to get your config and connect to <b>🚀 {logo_name}</b>!
ru: ✅ <b>Оплата прошла успешно!</b> Тариф: <b>{tariff_name}</b> Ваша подписка <code>{sub_name}</code> активирована. 👇 Нажмите кнопку ниже, чтобы получить конфиг и подключиться к <b>🚀 {logo_name}</b>!

# start_message
source: Hello, {name}! 👋 🔐 <b>QuickVPN</b> — your <u>personal internet accelerator</u> and data protection bro! 🌍 <b>What you get in a couple of clicks:</b> 🚀 <b>Maximum speed</b> — no lag in Shorts, Reels, YouTube ⚡ <b>2-in-1:</b> Protection + Acceleration, saving up to 30% battery 🛡️ <b>Absolute privacy</b> — no leaks, unlike free VPNs 📶 <b>Stable IP</b> — no bans, no blocks 🎯 Works anywhere you have internet. <b>✨ While others are lagging — you are flying!</b> 💰 <b>Bonus:</b> invite a friend and get <u>{commission_precent}% of their first purchase</u> right to your balance! ——— 👇 <b>Choose an action</b> — everything is in the menu: 🔹 /profile — <b>My subscriptions and configs</b> 🔹 /referral — <b>Referral program</b> 🔹 /help — <b>Connection setup help</b> 🔹 /about — <b>About us, contacts, and how everything works</b>
ru: Привет, {name}! 👋 🔐 <b>QuickVPN</b> — твой <u>персональный ускоритель интернета</u> и бро в защите данных! 🌍 <b>Что ты получаешь за пару кликов:</b> 🚀 <b>Максимальную скорость</b> — никакого лага в Shorts, Reels, YouTube ⚡ <b>2-в-1:</b> Защита + Ускорение, экономия батареи до 30% 🛡️ <b>Абсолютная приватность</b> — без сливов, как в бесплатных VPN 📶 <b>Стабильный IP</b> — ни бана, ни блокировок 🎯 Работает в любой точке где у тебя есть интернет. <b>✨ Пока другие тормозят — ты летишь!</b> 💰 <b>Бонус:</b> приведи друга и получи <u>{commission_precent}% от его первой покупки</u> прямо себе на баланс! ——— 👇 <b>Выбери действие</b> — всё по команде в меню: 🔹 /profile — <b>Мои подписки и конфиги</b> 🔹 /referral — <b>Реферальная программа</b> 🔹 /help — <b>Помощь в настройке подключения</b> 🔹 /about — <b>Контакты, о нас и как всё работает</b>

# first_trial_message
source: 🎉 🎁 You've received <b>🎈 PROMO ACCESS 🎈</b> — to <u>try QuickVPN</u> <b>without limits or ads</b>! 🔥 Get your key in <b>/profile</b> and start using it right now! 🚀 💡 Don't miss the chance to feel true freedom on the internet — speed, security, and convenience in one package! ⚡️ <i>Hurry up while the promo access is active!</i>
ru: 🎉 🎁 Ты получил <b>🎈 ПРОМО ДОСТУП 🎈</b> — чтобы <u>попробовать QuickVPN</u> <b>без ограничений и рекламы</b>! 🔥 Забирай свой ключ в <b>/profile</b> и начинай пользоваться уже сейчас! 🚀 💡 Не упусти шанс почувствовать настоящую свободу в интернете — скорость, безопасность и удобство в одном пакете! ⚡️ <i>Поторопись, пока промо действует!</i>

source: 📲 Get configuration
ru: 📲 Получить конфигурацию

# get_promo
source: 🎁 Get promo subscription
ru: 🎁 Получить промо подписку

# buy_new_sub
source: ➕ Buy a new subscription
ru: ➕ Купить новую подписку

# extend_sub
source: 🔁 Renew subscription
ru: 🔁 Продлить подписку

# get_configs
source: ⚙️ Get active configs
ru: ⚙️ Получить действующие конфиги

# try_bot
source: 🚀 Try QuickVPN — anonymous and fast VPN. Connect in 2 minutes!
ru: 🚀 Попробуй QuickVPN — анонимный и быстрый VPN. Подключи за 2 минуты!

# share_url
source: 📲 Share link
ru: 📲 Поделиться ссылкой

source: 💳 Pay
ru: 💳 Оплатить

# instructions
source: 📱 Installation instructions
ru: 📱 Инструкции по установке

source: ❓ FAQ
ru: ❓ Частые вопросы (FAQ)

# support
source: 🗣️ Contact support
ru: 🗣️ Связаться с поддержкой

# back_menu
source: ⬅️ Back to help menu
ru: ⬅️ Назад в меню помощи

# extend_now
source: 🔁 Renew now
ru: 🔁 Продлить сейчас

# language-selection-message
source: Please select your language:
ru: Пожалуйста, выберите ваш язык:

# language-changed-message
source: ✅ Language has been successfully changed to English.
ru: ✅ Язык успешно изменен на Русский.

# subscription_deactivated_message
source: 👋 Your subscription <b>{sub_name}</b> has expired. Access to the servers under this subscription has been automatically disabled. To keep enjoying fast and secure internet, you can purchase a new subscription from the /profile menu. Thank you for being with us!
ru: 👋 Ваша подписка <b>{sub_name}</b> истекла. Доступ к серверам по этой подписке был автоматически отключён. Чтобы продолжить пользоваться быстрым и безопасным интернетом, приобретите новую подписку в меню /profile. Спасибо, что были с нами!

# subscription_expiration_warning_message
source: ⏳ <b>Your subscription is about to expire!</b> Hello! Your subscription <code>{sub_name}</code> will expire <b>tomorrow</b>. Keep enjoying the internet without limits, lags, or ads. Tap /profile to renew it in just a couple of clicks and make sure you don’t lose protection when you need it most.
ru: ⏳ <b>Ваша подписка скоро истекает!</b> Здравствуйте! Ваша подписка <code>{sub_name}</code> истекает <b>завтра</b>. Продолжайте наслаждаться интернетом без границ, лагов и рекламы. Нажмите /profile, чтобы продлить её всего в пару кликов и не остаться без защиты в самый нужный момент.

# welcome_message_universal
source: 👋 <b>Welcome to {logo_name}!</b> ✅ Your subscription has been successfully activated. 👇 Click the button below to open your subscription and connect: If you have any questions, you can always contact support. Enjoy your experience!
ru: 👋 <b>Добро пожаловать в {logo_name}!</b> ✅ Ваша подписка успешно активирована. 👇 Нажмите на кнопку ниже, чтобы открыть подписку и подключиться: Если возникнут вопросы — всегда можете обратиться в поддержку. Приятного пользования!

# command-start-description
source: 🚀 Start work
ru: 🚀 Начало работы

# command-profile-description
source: 👤 My profile and subscriptions
ru: 👤 Мой профиль и подписки

# command-referral-description
source: 👥 Referral program
ru: 👥 Реферальная программа

# command-help-description
source: 🛟 Setup help
ru: 🛟 Помощь в настройке

# command-about-description
source: ℹ️ About the service
ru: ℹ️ О сервисе

# command-language-description
source: 🌍 Change language
ru: 🌍 Сменить язык
